{
    "id": "5131176032",
    "name": "Biology 7",
    "image": "https://api.schoology.com/sites/all/themes/schoology_theme/images/course-default.svg",
    "updates": [
        {
            "body": "Important T2 Update: \n1.Please check Schoology assignments for Lesson 8, 9, 10, 11. These must be completed. \n2. Completed Precomp study packet \n3. Test or Quiz corrections for under 80 upto 80%",
            "id": 5664775270,
            "likes": 1,
            "liked": false,
            "comments": 0
        },
        {
            "body": "Dear Students, \nThe submissions are enables for Lesson 11 - Fungi. Please upload the assignment so it can graded and returned ASAP. This grade will affect T2 scores. \nThanks,",
            "id": 5664512322,
            "likes": 1,
            "liked": false,
            "comments": 0
        },
        {
            "body": "Important T2 Update: \n1. Please check Schoology assignments for Lesson 9, 10, 11. These must be graded. \n2. Completed Precomp study packet \n3. Test or Quiz corrections for under 80% upto 80%",
            "id": 5637457607,
            "likes": 1,
            "liked": false,
            "comments": 0
        },
        {
            "body": "Dear Students,\nUnder \"Materials\" you will find a mock precomp test posted. This test may be taken anytime up until next Monday, Jan 31. It is NOT graded and can be taken multiple times. It is a good practice to get a feel for answering 35 questions in 30 minutes. I am also offering optional Zoom office hours on Monday after school. Here is the link:  https://springeducationgroup.zoom.us/j/2816563209. Please note that I have office hours today, Friday Jan. 28  during P4. You may stop by for any questions you have to clarify. \nBest of luck!",
            "id": 5611800773,
            "likes": 1,
            "liked": false,
            "comments": 0
        },
        {
            "body": "Dear Students, \nI am attaching the Study Guide here that lists all the resources that are critical for your study for PreComp. I find that students are losing this sheet in class. Please refer to it as needed. \nBest of luck!\nMs. Gousia",
            "id": 5605549711,
            "likes": 1,
            "liked": false,
            "comments": 0
        },
        {
            "body": "Hello students, \nPlease join my virtual office hours on Tuesday, p4 using the link below. I would love to see you! \nhttps://springeducationgroup.zoom.us/j/2816563209 \n- Ms. Gousia\n ",
            "id": 5545700453,
            "likes": 2,
            "liked": false,
            "comments": 0
        },
        {
            "body": "Dear Students, \nPlease note that there is no homework over the break! \nThanks,",
            "id": 5449421628,
            "likes": 2,
            "liked": false,
            "comments": 0
        },
        {
            "body": "Hello, \nPlease note that Chapter 2 Section 1 Page 32-35 is omitted from the quiz. Please skip that when you review for the quiz.",
            "id": 5437039517,
            "likes": 2,
            "liked": false,
            "comments": 0
        },
        {
            "body": "Dear Students, \nYou must check your assignments and come to office hours to update your grade. By the end of the week I will be closing the grade book. Make sure you have updated all your assignments.\nThanks,",
            "id": 5413213790,
            "likes": 1,
            "liked": false,
            "comments": 0
        },
        {
            "body": "Hello, \nPlease do not spend more than 20 minutes on Biology homework. Try your best! Skip any question that you find confusing. I will go over each answer in class.\nThanks,",
            "id": 5398391281,
            "likes": 2,
            "liked": false,
            "comments": 0
        },
        {
            "body": "Dear students, \nThis is a reminder that last week you were given a study guide for test coming up this week. The study guide has all resources, topics, date, and day for the test. \nThanks,",
            "id": 5396202355,
            "likes": 2,
            "liked": false,
            "comments": 0
        },
        {
            "body": "Dear Students, \nCheck your gradebook and if you see comments you must come and see me during the office hours. \nThanks,",
            "id": 5387853967,
            "likes": 1,
            "liked": false,
            "comments": 0
        },
        {
            "body": "Dear Students, \nPlease pick up cell models that belong to you before we take off for Fall break.\nThanks,",
            "id": 5374123675,
            "likes": 3,
            "liked": true,
            "comments": 0
        },
        {
            "body": "Please note that in the review packet that I gave you, skip pages 144, 145, 146, and 147. I am attaching the answer key just in case you need it. Best of Luck for Test 2.\n\n ",
            "id": 5340545569,
            "likes": 1,
            "liked": false,
            "comments": 0
        },
        {
            "body": "Dear students, \nI am happy to inform you that I am offering an additional office hour on Friday P4. I encourage and highly recommend that you come see me during office hours for any concerns you may have. You can bring your device and I can go over your assignment and help you fix it. Mostly there are minor changes that I am asking for.\nThanks,",
            "id": 5330882601,
            "likes": 1,
            "liked": false,
            "comments": 0
        },
        {
            "body": "Dear Students, \nI expect all students to type their notes neatly and upload like I showed you in class. If you have an issue come and see me in office hours. \nThanks,",
            "id": 5326345845,
            "likes": 2,
            "liked": true,
            "comments": 0
        },
        {
            "body": "Next week Sep. 20 - 24 is the week of your test. Test is always on Day 3 of your class. I have made you write test date and test topics in your Biology notebook.\nTest Topics: Lesson 2- 6 on Schoology. \nBest of luck!",
            "id": 5324132230,
            "likes": 2,
            "liked": false,
            "comments": 0
        },
        {
            "body": "Hello, \nThis week is the study week for Test 2. Next week is the week of Test 2. You take test on Day 3. \nTest Topics: Lesson 2 - 6 on Schoology\nThanks,",
            "id": 5315267853,
            "likes": 1,
            "liked": false,
            "comments": 0
        },
        {
            "body": "Hello, \nPlease spend only 20 minutes for Biology homework. I will understand and not penalize you for the homework not completed. \nThanks,",
            "id": 5312376154,
            "likes": 1,
            "liked": false,
            "comments": 0
        },
        {
            "body": "Hello, \nThis week of September 13 - 17 is the week you must start studying for the test that is coming up next week. You will receive your Test 1 this week. You must make Test Corrections in your Biology Noteboook either during office hours or at home and show me. \nThanks,",
            "id": 5310611057,
            "likes": 1,
            "liked": false,
            "comments": 0
        }
    ],
    "assignments": [
        {
            "id": 5205115140,
            "name": "1_Scientist Poster",
            "info": "1. Research a scientist. Can be from the class list or another one that you choose. \n2. Answer these questions:What field are they in? (bio, chem, physics, engineering, etc--biology preferred.\n3. What is their most important scientific achievement?\n4. How does this achievement help people, help society, or advance knowledge?\n5. Draw a poster about your scientist to hang up in the classroom. Poster should have at least 1 picture and 1-2 sentences or phrases. \r\n\n6.SUBMISSION:  Make a submission in Schoology  by typing this :  I have schoology access and I will bring the poster to the class!",
            "url": "https://app.schoology.com/assignment/5205115140",
            "completed": 1,
            "due": "2021-08-20 07:00:00"
        },
        {
            "id": 5208108853,
            "name": "2_Characteristics of Living things",
            "info": "1. Please read over the slides\n2. After or during lecture write notes as shown in class. Add all details, correct spellings, and cover all concepts. \n3. Submit the notes \n4. Read over the slides 7-3.3. You must write answers to the questions that I will give based on these slides on a separate doc and share with me in class.\nSubmission 1: Submit notes on Characteristics of Living Things",
            "url": "https://app.schoology.com/assignment/5208108853",
            "completed": 1,
            "due": "2021-08-27 07:00:00"
        },
        {
            "id": 5238220387,
            "name": "3.1_Cell Model and Presentation",
            "info": "Please copy paste the following and submit:\nMy name is _________\nI made and presented in class a __________ cell model.",
            "url": "https://app.schoology.com/assignment/5238220387",
            "completed": 1,
            "due": "2021-08-27 23:59:00"
        },
        {
            "id": 5231244739,
            "name": "3_Cells and Cell Theory",
            "info": "1st class: I will use slides to lecture. You may take notes in class or at home. You may use the notes that I have attached or make your won. Notes must have all details, required idagrams, correct spellings, and examples. \n2nd class: Choose between prokaryotic or eukaryotic cell. Make a model and bring to class. You will be graded for being able to show and explain all important cell organelles. Please refer to the notes for the names of the organelles you need to include in the model.\n3rd class: You will take a quiz in class on Lesson 2 and 3. \nSubmission: Submit notes on cells",
            "url": "https://app.schoology.com/assignment/5231244739",
            "completed": 1,
            "due": "2021-08-27 23:59:00"
        },
        {
            "id": 5250524656,
            "name": "4_Biochemistry",
            "info": "Day 1: At home: Make notes using the slides. Do as much as you can. We can still work on this in class and during office hours.\nIn class: We will make monomers and polymers of the macromolecules, watch a 3 minute video, work in pairs to dicuss the characteristics of each, draw the macromolecules structure in notebooks\nDay 2: At home: Review L 2, 3, 4, \nIn class: We will do a DNA extraction using strawberries. We will write answers to the Bio7 Assignment 03 - Macromolecules as I scaffold.\nDay 3: Biology Test L 2, 3, 4\nIn class: We will take test and go home happy!\nSubmission: Submit Notes -04-Biochemistry",
            "url": "https://app.schoology.com/assignment/5250524656",
            "completed": 1,
            "due": "2021-09-03 07:00:00"
        },
        {
            "id": 5284207845,
            "name": "5_Evolution",
            "info": "Day 1: In class I will explain that evolution happens by a series steps called natural selection. You will do Lab activity to model the natural selection process. You will also write the steps of the natural selection. Finally you will read the handout on Evolution on Puppies and answer questions.\nAt home - You may complete notes realted to the following sections only- Evolution, Natural Selection. Ofcourse you can complete all notes if you want. But please do not feel that I have assigned you to complete all notes in a day.\nDay 2: In class I will explain evolution, the related theories, and evidences. I will also explain Speciation using examples. I will givev you time in class to complete notes.\nAt home - You may complete the remaining notes and submit.\nSubmission: Submit notes on Evoltuion",
            "url": "https://app.schoology.com/assignment/5284207845",
            "completed": 1,
            "due": "2021-09-10 23:59:00"
        },
        {
            "id": 5311167981,
            "name": "6_Classification",
            "info": "Day 1: HW: Use slides to complete notes. You may use your own words to paraphase the information on the slides when you make notes. If you are stuck on a blank in the notes you may ask me about that in class or come to my office hours. Please do not think that I will take off points for incomplete blanks. I will help you locate and write information. You must make sure that you are not missing any information from the slides. \nClassification mobile: Uisng papar make a mobile for 3 Domains and 6 Kingdoms. Use the slides to write correct spelling. Use the picture I posted to get an idea of what the mobile should look like.\nDay 2: HW: Complete notes as much as possible and upload if you can. You will use notes to take an open notes quiz on Classification on Day 3. Complete video recap write up later and focus on completing notes so you can use it for Quiz.\nDay 3 :HW:  Submit notes + study for the test next week.\nDay 1, 2, 3 CW: I will teach concepts related to Classification. You will  write answers to the questions I give you in class in your Biology botebook, and draw the classfication chart. \nThis entire week you must study for the upcoming test next week on the week of Sep. 20 - 24. Please note that I am giving you the test date and topics a whole week before the actual test.\nSubmission: You must submit notes on Classification. ",
            "url": "https://app.schoology.com/assignment/5311167981",
            "completed": 1,
            "due": "2021-09-20 07:00:00"
        },
        {
            "id": 5315290937,
            "name": "Test 2 Prep",
            "info": "Day1: HW - Study for test. Complete questions assigned in class. Work on Speciation WS + Video Recap Worksheet\nIn class I will review Biochemistry. This will be a detailed review. We will detect presence of macromolecules in foods.  We will make polymers (lipids) out of monomers (fatty acids) for all macromolecules.  \nDay 2: HW - Study for test. Complete questions from the packet. Work on Speciation WS + Video Recap Worksheet\nDay 3: HW: Test is done. Upload the assignments: Work on Speciation WS + Video Recap Worksheet\nTest Topics: Lesson 2-6 in Schoology. You take your test on Day 3 of our class. You have the test date in your biology notebook. Please check.\nAlso note that any PDF that says Quiz is actually just practice. The Galapagos Islands is another sheet that I will do in class. \nSubmission: Speciation WS. You will find this in Lesson 5 + Video Recap Worksheet. You will find this in Lesson 6",
            "url": "https://app.schoology.com/assignment/5315290937",
            "completed": 1,
            "due": "2021-09-27 07:00:00"
        },
        {
            "id": 5346882817,
            "name": "7_Virus",
            "info": "Day 1: Read page 35 and answer the Reading Check question in notebook. Bring materials to make capsid and spike protein (like toothpicks, gummies, paper, sandwich wrap)\nDay 2: Read page 36. Draw and label the lytic cycle.\nDay 3: Answer Section Review questions on page 37. Check answers using the answer key in class and upload the PDF on Schoology.\nSubmission: Please upload answers on page 37 as a PDF in Schoology",
            "url": "https://app.schoology.com/assignment/5346882817",
            "completed": 1,
            "due": "2021-10-04 07:00:00"
        },
        {
            "id": 5354669229,
            "name": "8_Prokaryotes: Archaea & Bacteria",
            "info": "Day 1: Read page 24 and 25. Answer the reading check question in the notebook.\nDay 2: Study for quiz on virus\nDay 3:  Your homework is to simply upload the corrected answers.  First you will answers to questions 1-5 on page 29 in notebook.  Next, we will check answers using colored pen. Then you will upload. So please do not work ahead.  ",
            "url": "https://app.schoology.com/assignment/5354669229",
            "completed": 1,
            "due": "2021-10-13 23:59:00"
        },
        {
            "id": 5396186370,
            "name": "Test 3 prep_ Bacteria, Archaea, and Virus",
            "info": "Day 1: Study for the test + Chp. 2 Section 2 pg. 33 1-5 and 8\nDay 2: Study for the test\nDay 3: Upload Chapter 2 Section 2 answers after we correct in class.",
            "url": "https://app.schoology.com/assignment/5396186370",
            "completed": 1,
            "due": "2021-10-25 07:00:00"
        },
        {
            "id": 5405733603,
            "name": "9_Ecology",
            "info": "Day 1: Please read Chp. 3 Section 1. Answer questions on pg. 57 (1 - 6)\nDay 2: Please read Chp. 3 Section 2 Pg. 62 & 63. Answer # 5 on pg. 63\nDay 3: Please read Chp. 3 Section 3 Pg. 66 & 67. Answer # 3 & 4 on pg. 67\nAll homework is done in the notebook\nNo Schoology Upload",
            "url": "https://app.schoology.com/assignment/5405733603",
            "completed": 1,
            "due": "2021-11-01 07:00:00"
        },
        {
            "id": 5427800831,
            "name": "9_Ecology 2",
            "info": "Day 1 : Please check Schoology assignments. Make corrections and come to office hours to confirm. My office hours are T, W, F P4\n            Please write answers for questions on Pg. 22 (questions 1-5) in your biology notebook\nDay 2: Please check Schoology assignments. Make corrections and come to office hours to confirm. My office hours are T, W, F P4\n           Quiz study\nDay 3: Upload answers for pg. 21 (questions 1-5), pg. 13 (questions 1-5) in Schoology. By this time you should have already corrected the answers using the Answer key. \n ",
            "url": "https://app.schoology.com/assignment/5427800831",
            "completed": 1,
            "due": "2021-11-29 23:59:00"
        },
        {
            "id": 5457633202,
            "name": "10_ Protists",
            "info": "Day 1: Answer questions 1 - 5 on pg. 51 in your notebook. \nDay 2: Answer questions 1 - 4 on pg. 59 in your notebook.\nDay 3: Upload answers on pg. 51 and 59 in Schoology. By this time we should have checked these answers in class using the answer key.\nSubmission: Upload answers on pg. 51 and 59 in Schoology.",
            "url": "https://app.schoology.com/assignment/5457633202",
            "completed": 1,
            "due": "2021-12-03 23:59:00"
        },
        {
            "id": 5609977817,
            "name": "Mock precomp Biology",
            "info": "",
            "url": "https://app.schoology.com/assignment/5609977817",
            "completed": 1,
            "due": "2022-01-31 20:00:00"
        },
        {
            "id": 5478018343,
            "name": "11_Fungi",
            "info": "Day 1: Read page 60-61 and 66. Answer the Reading Check question on page 61 and 66.\nDay 2: Read page 62-65. Answer the Reading Check question on page 64.\nDay 3: Schoology upload for answers on pg. 67. By this time we would have already written answers in class and checked using teh answer key.\nSubmission: Upload answers on pg. 67. ",
            "url": "https://app.schoology.com/assignment/5478018343",
            "completed": 1,
            "due": "2022-02-11 20:00:00"
        },
        {
            "id": 5664521722,
            "name": "12_Plants",
            "info": "",
            "url": "https://app.schoology.com/assignment/5664521722",
            "completed": 1,
            "due": "2022-02-27 23:59:00"
        }
    ]
}