{
    "id": "5131176032",
    "name": "Biology 7",
    "image": "https://api.schoology.com/sites/all/themes/schoology_theme/images/course-default.svg",
    "updates": [
        {
            "body": "Important T2 Update: \n1.Please check Schoology assignments for Lesson 8, 9, 10, 11. These must be completed. \n2. Completed Precomp study packet \n3. Test or Quiz corrections for under 80 upto 80%",
            "id": 5664775270,
            "likes": 1,
            "liked": false,
            "comments": 0
        },
        {
            "body": "Dear Students, \nThe submissions are enables for Lesson 11 - Fungi. Please upload the assignment so it can graded and returned ASAP. This grade will affect T2 scores. \nThanks,",
            "id": 5664512322,
            "likes": 1,
            "liked": false,
            "comments": 0
        },
        {
            "body": "Important T2 Update: \n1. Please check Schoology assignments for Lesson 9, 10, 11. These must be graded. \n2. Completed Precomp study packet \n3. Test or Quiz corrections for under 80% upto 80%",
            "id": 5637457607,
            "likes": 1,
            "liked": false,
            "comments": 0
        },
        {
            "body": "Dear Students,\nUnder \"Materials\" you will find a mock precomp test posted. This test may be taken anytime up until next Monday, Jan 31. It is NOT graded and can be taken multiple times. It is a good practice to get a feel for answering 35 questions in 30 minutes. I am also offering optional Zoom office hours on Monday after school. Here is the link:  https://springeducationgroup.zoom.us/j/2816563209. Please note that I have office hours today, Friday Jan. 28  during P4. You may stop by for any questions you have to clarify. \nBest of luck!",
            "id": 5611800773,
            "likes": 1,
            "liked": false,
            "comments": 0
        },
        {
            "body": "Dear Students, \nI am attaching the Study Guide here that lists all the resources that are critical for your study for PreComp. I find that students are losing this sheet in class. Please refer to it as needed. \nBest of luck!\nMs. Gousia",
            "id": 5605549711,
            "likes": 1,
            "liked": false,
            "comments": 0
        },
        {
            "body": "Hello students, \nPlease join my virtual office hours on Tuesday, p4 using the link below. I would love to see you! \nhttps://springeducationgroup.zoom.us/j/2816563209 \n- Ms. Gousia\n ",
            "id": 5545700453,
            "likes": 2,
            "liked": false,
            "comments": 0
        },
        {
            "body": "Dear Students, \nPlease note that there is no homework over the break! \nThanks,",
            "id": 5449421628,
            "likes": 2,
            "liked": false,
            "comments": 0
        },
        {
            "body": "Hello, \nPlease note that Chapter 2 Section 1 Page 32-35 is omitted from the quiz. Please skip that when you review for the quiz.",
            "id": 5437039517,
            "likes": 2,
            "liked": false,
            "comments": 0
        },
        {
            "body": "Dear Students, \nYou must check your assignments and come to office hours to update your grade. By the end of the week I will be closing the grade book. Make sure you have updated all your assignments.\nThanks,",
            "id": 5413213790,
            "likes": 1,
            "liked": false,
            "comments": 0
        },
        {
            "body": "Hello, \nPlease do not spend more than 20 minutes on Biology homework. Try your best! Skip any question that you find confusing. I will go over each answer in class.\nThanks,",
            "id": 5398391281,
            "likes": 2,
            "liked": false,
            "comments": 0
        },
        {
            "body": "Dear students, \nThis is a reminder that last week you were given a study guide for test coming up this week. The study guide has all resources, topics, date, and day for the test. \nThanks,",
            "id": 5396202355,
            "likes": 2,
            "liked": false,
            "comments": 0
        },
        {
            "body": "Dear Students, \nCheck your gradebook and if you see comments you must come and see me during the office hours. \nThanks,",
            "id": 5387853967,
            "likes": 1,
            "liked": false,
            "comments": 0
        },
        {
            "body": "Dear Students, \nPlease pick up cell models that belong to you before we take off for Fall break.\nThanks,",
            "id": 5374123675,
            "likes": 3,
            "liked": true,
            "comments": 0
        },
        {
            "body": "Please note that in the review packet that I gave you, skip pages 144, 145, 146, and 147. I am attaching the answer key just in case you need it. Best of Luck for Test 2.\n\n ",
            "id": 5340545569,
            "likes": 1,
            "liked": false,
            "comments": 0
        },
        {
            "body": "Dear students, \nI am happy to inform you that I am offering an additional office hour on Friday P4. I encourage and highly recommend that you come see me during office hours for any concerns you may have. You can bring your device and I can go over your assignment and help you fix it. Mostly there are minor changes that I am asking for.\nThanks,",
            "id": 5330882601,
            "likes": 1,
            "liked": false,
            "comments": 0
        },
        {
            "body": "Dear Students, \nI expect all students to type their notes neatly and upload like I showed you in class. If you have an issue come and see me in office hours. \nThanks,",
            "id": 5326345845,
            "likes": 2,
            "liked": true,
            "comments": 0
        },
        {
            "body": "Next week Sep. 20 - 24 is the week of your test. Test is always on Day 3 of your class. I have made you write test date and test topics in your Biology notebook.\nTest Topics: Lesson 2- 6 on Schoology. \nBest of luck!",
            "id": 5324132230,
            "likes": 2,
            "liked": false,
            "comments": 0
        },
        {
            "body": "Hello, \nThis week is the study week for Test 2. Next week is the week of Test 2. You take test on Day 3. \nTest Topics: Lesson 2 - 6 on Schoology\nThanks,",
            "id": 5315267853,
            "likes": 1,
            "liked": false,
            "comments": 0
        },
        {
            "body": "Hello, \nPlease spend only 20 minutes for Biology homework. I will understand and not penalize you for the homework not completed. \nThanks,",
            "id": 5312376154,
            "likes": 1,
            "liked": false,
            "comments": 0
        },
        {
            "body": "Hello, \nThis week of September 13 - 17 is the week you must start studying for the test that is coming up next week. You will receive your Test 1 this week. You must make Test Corrections in your Biology Noteboook either during office hours or at home and show me. \nThanks,",
            "id": 5310611057,
            "likes": 1,
            "liked": false,
            "comments": 0
        }
    ]
}